{
  "name": "IntelliLearn",
  "description": "IntelliLearn is your personal AI-powered learning assistant, designed to transform any educational material into a dynamic and engaging study experience. The application provides a structured environment where users can create courses and add chapters, building a personalized library of learning modules.\n\nAt the core of each chapter is the ability to upload source material in various formats, including PDF documents, plain text files (.txt), and images (.jpg, .png). The app intelligently processes these files, extracting text from PDFs and preparing content for AI analysis.\n\nOnce a file is uploaded, IntelliLearn unlocks a suite of powerful, AI-driven tools to create custom study aids:\n\n- **AI Summaries:** Generate concise, easy-to-digest summaries of lengthy documents, complete with headings and bullet points for maximum clarity.\n\n- **Interactive Quizzes:** Automatically create multiple-choice quizzes based on the source material. Each quiz question comes with several options and an interactive checking mechanism to test your knowledge and reinforce learning.\n\n- **Flippable Flashcards:** Produce a set of digital flashcards for key terms and definitions found in your content. The viewer features an interactive, 3D flipping animation and easy navigation, making memorization effective and fun.\n\n- **Manga Mode:** A unique and creative feature that converts your study material into a visually compelling manga (Japanese-style comic). The AI first crafts a multi-panel script with scene descriptions, dialogue, and narration. It then generates a unique, black-and-white manga-style image for each panel, bringing your lessons to life in a narrative format.\n\nThe user interface is clean, modern, and responsive, featuring a tab-based system to easily switch between the generated summary, quiz, flashcards, and manga. All your courses and generated content are saved locally in your browser, ensuring your study materials are always available when you return. IntelliLearn leverages the power of Google's Gemini AI to provide a seamless, intelligent, and highly personalized learning journey.",
  "requestFramePermissions": []
}